tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
tap "homebrew/services"
tap "thoughtbot/formulae"
tap "homebrew/cask-fonts"

# management suite for dotfiles
brew "thoughtbot/formulae/rcm"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Swiss-army knife of markup format conversion
brew "pandoc"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Manage your Java environment
brew "jenv"
# Java build tool
brew "ant"
# Maven version manager
brew "mvnvm"
# Command-line interface for SQLite
brew "sqlite"
# Pack, ship and run any application as a lightweight container
cask "docker"
# Interpreted, interactive, object-oriented programming language
brew "python@2"
# Distributed revision control system
brew "git"
# Add GitHub support to git on the command-line
brew "hub"
# Command-line interface for Jfrog Artifactory and Bintray
brew "jfrog-cli-go"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tools for one-time password authentication systems
brew "oath-toolkit"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Editor of encrypted files
brew "sops"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# Terraform version manager inspired by rbenv
brew "tfenv"
# JavaScript package manager
brew "yarn"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Google Cloud SDK
cask "google-cloud-sdk"
cask "keybase"
# Install inconsolata font
cask "font-inconsolata"

mas "1Password", id: 443987910
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Trello", id: 1278508951
mas "Xcode", id: 497799835
mas "You Need a Budget 4", id: 614680722
